docs/comp-sci/theorem-provers/soft-types.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Soft Type System</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Soft Type System</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-59371bea-b6af-4a93-9a75-133d687e25e3">1. Idea</a></li>
<li><a href="#h-bb2328e4-6f99-4f79-9b25-4711aa0d9ac5">2. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-59371bea-b6af-4a93-9a75-133d687e25e3" class="outline-2">
<h2 id="h-59371bea-b6af-4a93-9a75-133d687e25e3"><span class="section-number-2">1.</span> Idea</h2>
<div class="outline-text-2" id="text-h-59371bea-b6af-4a93-9a75-133d687e25e3">
<p>
In type theory, when we write the type judgement \(\Gamma\vdash t:T\),
this is a proposition in the metalanguage. But in ordinary mathematics,
we often muddle metavariables and object variables (more generally, we
muddle metalanguage constructs with object language constructs). We can
approximate this muddling by building in the object language a typing
judgement and a type system. This type system is called a
<dfn>Soft Type System</dfn>.
</p>

<p>
More specifically, instead of writing something like <code>G : Group</code>, we
have a unary predicate <code>isGroup[-]</code> and treat the judgement as
<code>isGroup[G]</code>.
</p>

<dl class="org-dl">
<dt>Subtyping</dt><dd>for all <code>x</code>, <code>isSubtype[x]</code> implies <code>isSupertype[x]</code>.</dd>
<dt>Dependent Types</dt><dd>A dependent type with \(n\) parameters is encoded as
an \((n+1)\) -ary predicate.</dd>
</dl>
</div>
</div>

<div id="outline-container-h-bb2328e4-6f99-4f79-9b25-4711aa0d9ac5" class="outline-2">
<h2 id="h-bb2328e4-6f99-4f79-9b25-4711aa0d9ac5"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-h-bb2328e4-6f99-4f79-9b25-4711aa0d9ac5">
<ul class="org-ul">
<li>Freek Wiedijk,<br>
"Mizar's Soft Type System".<br>
In <cite class="book-title">International Conference on Theorem Proving in Higher Order Logics</cite>
(pp. 383-399). Springer, Berlin, Heidelberg.
<a href="http://cs.ru.nl/F.Wiedijk/mizar/miztype.pdf">Eprint</a>, 17 pages.
<ul class="org-ul">
<li>Wiedijk invented the notion of soft type systems to describe Mizar's
typing system.</li>
</ul></li>
<li>Cezary Kaliszyk, Florian Rabe,<br>
"A Survey of Languages for Formalizing Mathematics".
A CICM2020 paper, <a href="https://arxiv.org/abs/2005.12876">arXiv:2005.12876</a>, 19 pages
<ul class="org-ul">
<li>This paper seems to invent the notion of a "semi-soft type system"
and a "hard type system"</li>
</ul></li>
<li>Florian Rabe,<br>
"A Language with Type-Dependent Equality".<br>
<a href="https://kwarc.info/people/frabe/Research/rabe_tde_21.pdf">Eprint</a>, 16 pages
<ul class="org-ul">
<li>Notes how soft-type systems makes typing and equality both undecidable.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-09-20 Mon 11:15.</p>
</div>
</body>
</html>